{
  "id": "202510-octubre",
  "start_date": "2025-10-15 18:30",
  "end_date": "2025-10-15 21:30",
  "location": {
    "venue": "Lyft",
    "address": "Av Paseo de la Reforma 296 Juárez, Cuauhtémoc, Ciudad de México"
  },
  "rsvp_link": "https://www.meetup.com/python-mexico/events/311168897/?utm_medium=referral&utm_campaign=share-btn_savedevents_share_modal&utm_source=link&utm_version=v2&member_id=249274048",
  "event_banner_image": "/images/meetup/202510-octubre.jpg",
  "video_url": "https://www.youtube.com/embed/ogAULHmqXGI",
  "talks": [
    {
      "title": "Explorando productos satelitales con Python",
      "subtitle": "De Sentinel-2 al mapeo de uso de suelo",
      "description": {
        "header": "Explotando productos satelitales con Python: de Sentinel-2 al mapeo de uso de suelo",
        "content": [
          "Los satélites como Sentinel-2 ofrecen una gran cantidad de información gratuita y abierta que puede ser usada en agricultura, medio ambiente y planificación territorial.",
          "En esta charla mostraremos cómo descargar y procesar imágenes satelitales con Python para extraer índices como NDVI, imágenes en true color y false color. Posteriormente, veremos cómo aplicar técnicas de Machine Learning para generar mapas de uso de suelo y analizar patrones agrícolas.",
          "La sesión combina teoría, código práctico y aplicaciones reales para que la comunidad pueda comenzar a explotar productos satelitales en sus propios proyectos"
        ]
      },
      "speaker": {
        "name": "Alejandro López",
        "title": "Software Engineer & Data Scientist",
        "bio": "Alejandro es un Ingeniero de software con experiencia en backend y ciencia de datos aplicada. Ha trabajado en proyectos con procesamiento de imágenes satelitales, arquitecturas en la nube y metodologías ágiles. Apasionado por aplicar la tecnología a resolver problemas complejos en agricultura, medio ambiente y comunidades.",
        "photo": "/images/ponentes/alejandro-lopez.jpeg"
      }
    }
  ],
  "storytelling": [
    "El martes se desplegó como un lienzo oscuro. Una noche donde la ciudad se rindió a la penumbra y las estrellas, pequeñas velas lejanas, comenzaron a bailar sobre el cielo como recordándonos que, incluso en la ausencia de faroles, hay luz suficiente para guiar la mirada y la imaginación.",
    "Desde el principio, la velada estuvo marcada por un rito: nuestros anfitriones de Lyft nos ofrecieron un breve pero fascinante viaje a través de su mundo, un susurro que contenía la esencia de sus proyectos y las puertas abiertas que existen para quienes buscan transformar la curiosidad en oportunidades laborales. Cada palabra resonaba con la cadencia de cuatro voces distintas, cuatro viajeros que compartían sus conocimientos como notas en un compás perfecto.",
    "Y entonces la noche cobró otra dimensión. Las luces se apagaron, el proyector despertó su propio universo y una diapositiva surgió como un portal: _\"Explotando productos satelitales con Python: de Sentinel-2 al mapeo de uso de suelo.\"_, anunciaba **Alejandro López**. Sus manos temblorosas no pudieron contener el magnetismo que comenzó a irradiar hacia la audiencia; cada línea de código ,cada idea, era un hilo que nos conectaba con lo remoto, con los satélites que planean sobre nosotros, silenciosos y elegantes, trazando trayectorias que la imaginación apenas alcanza a seguir.",
    "![Foto 1 - Meetup Octubre](/images/meetup/202510/01.jpeg)",
    "Alejandro nos llevó a un viaje entre la tierra y el espacioi: Cómo los satélites _Sentinel-2_ entregan océanos de información gratuita y abierta, y cómo Python se convierte en nuestra brújula para navegar esos datos, transformando imágenes en mapas de uso de suelo, extrayendo índices NDVI y revelando patrones que la tierra misma susurra a quienes saben escuchar.",
    "Cada click, cada fragmento de código, se convertía en un conjuro tecnológico que hacía tangible lo invisible: la vida agrícola, los bosques, la geografía, todo condensado en matrices de píxeles y algoritmos que, como pinceles digitales, pintaban la realidad con precisión y poesía.",
    "![Foto 2 - Meetup Octubre](/images/meetup/202510/02.jpeg)",
    "Entre teoría y práctica, Alejandro dejó caer perlas _que hicieron sonreír a quienes ya sabían_ y abrir los ojos a quienes apenas comenzaban: los satélites no vuelan, planean; las imágenes que vemos en Google Maps pesan más de lo que imaginamos; y detrás de esa simplicidad aparente, hay un arte meticuloso, una danza de datos que combina ciencia, ingenio y paciencia.",
    "Para aquellos que deseen volver a sumergirse en esta experiencia, revivir cada descubrimiento y cada destello de conocimiento, el instante sigue vivo aquí: [Revive el momento](#mira-la-charla-completa)",
    "![Foto 3 - Meetup Octubre](/images/meetup/202510/03.jpeg)",
    "Y así, como las estrellas que titilan en el cielo, la comunidad PythonCDMX sigue creciendo, reuniéndose, explorando. **La próxima entrega de nuestros encuentros nos espera, prometiendo otra noche donde la curiosidad y la tecnología se entrelacen**, y donde cada línea de código sea un pequeño destello en la vasta oscuridad de lo desconocido."
  ],
  "tags": [
    "Python",
    "OpenSource",
    "Mapping",
    "MachineLearning"
  ]
}
