{
  "id": "202502-febrero",
  "event_month_year": "Febrero 2025",
  "event_title": "Embeddings / Advent of Code",
  "event_subtitle": "Dos charlas sobre NLP y programaci贸n competitiva",
  "event_date": "Martes 11 de Febrero, 2025",
  "event_time": "18:30 - 21:00",
  "event_location": "Wizeline M茅xico, Torre Diana",
  "event_rsvp_link": "https://www.meetup.com/python-mexico/",
  "event_banner_image": "/images/meetup/202502-pythoncdmx.png",
  "talks": [
    {
      "title": "Lecciones del Advent of Code 2024",
      "description": "El Advent of Code es un reto de programaci贸n con desaf铆os diarios durante diciembre, dise帽ado para ejercitar la capacidad de resoluci贸n de problemas y el pensamiento algor铆tmico. En esta charla, compartir茅 mi experiencia participando en la edici贸n 2024, usando Python para resolver los desaf铆os. Discutir茅 las lecciones que me dej贸 esta experiencia y reflexionar茅 sobre c贸mo este reto no solo me permiti贸 profundizar en conocimientos t茅cnicos, sino que tambi茅n se convirti贸 en un valioso ejercicio de constancia y adaptaci贸n, aspectos fundamentales para cualquier desarrollador.",
      "conclusion": "El Advent of Code es una excelente manera de mejorar habilidades de programaci贸n y resoluci贸n de problemas.",
      "speaker": {
        "name": "Manuel R谩bade",
        "title": "Ingeniero en Computaci贸n",
        "bio": "Ingeniero en Computaci贸n y apasionado por el desarrollo de tecnolog铆a. Profesionalmente se dedica a la ingenier铆a de software y direcci贸n de equipos. Disfruta explorar temas t茅cnicos y participar en comunidades alrededor de la tecnolog铆a.",
        "photo": "/images/ponentes/202502-PythonCDMX-manuel-rabade.jpg",
        "linkedin": null,
        "github": null,
        "twitter": null
      },
      "tech_stack": [
        {
          "name": "Python",
          "description": "Lenguaje principal",
          "icon": "",
          "color": "#3776AB"
        },
        {
          "name": "Algorithms",
          "description": "Algoritmos",
          "icon": "М",
          "color": "#28a745"
        },
        {
          "name": "Problem Solving",
          "description": "Resoluci贸n de problemas",
          "icon": "",
          "color": "#ffc107"
        }
      ],
      "duration": "45 minutos"
    },
    {
      "title": "Embeddings - El lenguaje como las m谩quinas entienden el lenguaje humano",
      "description": "驴Alguna vez te has preguntado c贸mo las m谩quinas entienden el lenguaje humano? En este charla desentra帽amos el misterio de los embeddings, una t茅cnica clave en el NLP. Prep谩rate para: Descubrir qu茅 son los embeddings: Exploraremos c贸mo se transforman las palabras y frases en vectores num茅ricos que capturan su significado. Comprender su utilidad: Analizaremos c贸mo los embeddings permiten a las m谩quinas realizar tareas como la b煤squeda sem谩ntica, la traducci贸n autom谩tica y el an谩lisis de sentimientos. Explorar casos de uso reales: Desde sistemas de recomendaci贸n hasta chatbots inteligentes, veremos c贸mo los embeddings est谩n revolucionando la tecnolog铆a. Adentrarnos en las diferentes aproximaciones para obtener embeddings: Desglosaremos m茅todos como One Hot Encoding, Co-Ocurrence Matrix y el poderoso Word2Vec. Profundizar en Word2Vec: Descifraremos su funcionamiento y c贸mo logra capturar relaciones sem谩nticas entre palabras. Muchos ejemplos con Python",
      "conclusion": "Los embeddings son fundamentales para que las m谩quinas comprendan y procesen el lenguaje humano de manera efectiva.",
      "speaker": {
        "name": "Juan Guillermo G贸mez",
        "title": "L铆der T茅cnico",
        "bio": "Juan Guillermo fund贸 GDG Cali y co-organiza varios eventos globales y locales con Google Developer Groups. Ha estado involucrado en tecnolog铆a y programaci贸n de software durante los 煤ltimos 20 a帽os. Actualmente, es l铆der t茅cnico en WordBox. Juan es GDE (Google Developer Expert) en Firebase, IA/ML, GCP y Kotlin. Tiene una licenciatura en Ingenier铆a de Sistemas y una maestr铆a en Ingenier铆a de Software de la Universidad San Buenaventura Cali.",
        "photo": "/images/ponentes/202502-PythonCDMX-juan-gomez.jpg",
        "linkedin": null,
        "github": null,
        "twitter": null
      },
      "tech_stack": [
        {
          "name": "NLP",
          "description": "Natural Language Processing",
          "icon": "",
          "color": "#007bff"
        },
        {
          "name": "Word2Vec",
          "description": "Word embeddings",
          "icon": "",
          "color": "#28a745"
        },
        {
          "name": "Machine Learning",
          "description": "Aprendizaje autom谩tico",
          "icon": "",
          "color": "#ffc107"
        }
      ],
      "duration": "45 minutos"
    }
  ],
  "video": {
    "youtube_id": "fBPcHm2y4w4",
    "youtube_url": "https://www.youtube.com/watch?v=fBPcHm2y4w4"
  },
  "tags": [
    {"name": "Python", "icon": "", "color": "#3776AB"},
    {"name": "NLP", "icon": "", "color": "#007bff"},
    {"name": "Embeddings", "icon": "", "color": "#28a745"},
    {"name": "Advent of Code", "icon": "М", "color": "#ffc107"},
    {"name": "Machine Learning", "icon": "", "color": "#6f42c1"},
    {"name": "Word2Vec", "icon": "", "color": "#17a2b8"}
  ]
}
